iarsystems/ewarm-nxp-example-projects/LPC15xx/EA-LPC1500/Blinky/Common/inc/lpc13Axx.h
    __IO struct {                       /* 0x500-0x57C  SCTOUT[i].SET / SCTOUT[i].CLR */
        uint32_t SET;                   /* Output n Set Register */
        uint32_t CLR;                   /* Output n Clear Register */
    } OUT[CONFIG_SCT_nOU];

         uint32_t RESERVED10[191-2*CONFIG_SCT_nOU];  /* ...-0x7F8 reserved */

    __I  uint32_t MODULECONTENT;        /* 0x7FC Module Content */

} LPC_SCT_TypeDef;
/*@}*/ /* end of group LPC13Axx_SCT */


// ------------------------------------------------------------------------------------------------
// -----                                         WWDT                                         -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC11U1x Windowed Watchdog Timer (WWDT) Modification date=3/16/2011 Major revision=0 Minor revision=3  (WWDT)
  */

typedef struct {                            /*!< (@ 0x40004000) WWDT Structure         */
  __IO uint32_t MOD;                        /*!< (@ 0x40004000) Watchdog mode register*/
  __IO uint32_t TC;                         /*!< (@ 0x40004004) Watchdog timer constant register */
  __IO uint32_t FEED;                       /*!< (@ 0x40004008) Watchdog feed sequence register */
  __I  uint32_t TV;                         /*!< (@ 0x4000400C) Watchdog timer value register */
  __IO uint32_t CLKSEL;                     /*!< (@ 0x40004010) Watchdog clock select register. */
  __IO uint32_t WARNINT;                    /*!< (@ 0x40004014) Watchdog Warning Interrupt compare value. */
  __IO uint32_t WINDOW;                     /*!< (@ 0x40004018) Watchdog Window compare value. */
} LPC_WWDT_TypeDef;

// ------------------------------------------------------------------------------------------------
// -----                                         RIT                                          -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10462 Chapter title=LPC13Axx Repetitive Timer (RIT) or OS timer, Modification date=3/16/2011 Major revision=0 Minor revision=3  (RIT)
  */
typedef struct
{
  __IO uint32_t COMPVAL;
  __IO uint32_t MASK;
  __IO uint32_t CTRL;
  __IO uint32_t COUNTER;
  __IO uint32_t COMPVAL_H;
  __IO uint32_t MASK_H;
  __IO uint32_t COUNTER_H;
} LPC_RIT_TypeDef;


/*------------- Universal Asynchronous Receiver Transmitter (UART) -----------*/
/** @addtogroup LPC13Axx_UART LPC13Axx Universal Asynchronous Receiver/Transmitter 
  @{
*/
/**
  * @brief Product name title=Oscar MCU Chapter title=UART Modification date=4/18/2012 Major revision=0 Minor revision=9  (UART)
  */
typedef struct
{
  __IO uint32_t  CFG;								/* 0x00 */
  __IO uint32_t  CTRL;
  __IO uint32_t  STAT;
  __IO uint32_t  INTENSET;
  __O  uint32_t  INTENCLR;					/* 0x10 */
  __I  uint32_t  RXDATA;
  __I  uint32_t  RXDATA_STAT;
  __IO uint32_t  TXDATA;
  __IO uint32_t  BRG;								/* 0x20 */
  __IO uint32_t  INTSTAT;
       uint32_t  Reserved[1013];
  __I  uint32_t  ID;								/* 0xFFC */
} LPC_UART_TypeDef;

/*@}*/ /* end of group LPC13Axx_UART */


/*------------- Synchronous Serial Interface Controller (SPI) -----------------------*/
/** @addtogroup LPC13Axx_SPI LPC13Axx Synchronous Serial Port 
  @{
*/
typedef struct
{
  __IO uint32_t  CFG;			    /* 0x00 */
  __IO uint32_t  DLY;
  __IO uint32_t  STAT;
  __IO uint32_t  INTENSET;
  __O  uint32_t  INTENCLR;		/* 0x10 */
  __I  uint32_t  RXDAT;
  __IO uint32_t  TXDATCTL;
  __IO uint32_t  TXDAT;
  __IO uint32_t  TXCTRL;		  /* 0x20 */
  __IO uint32_t  DIV;
  __I  uint32_t  INTSTAT;
       uint32_t  Reserved[1012];
  __I  uint32_t  ID;			    /* 0xFFC */
} LPC_SPI_TypeDef;
/*@}*/ /* end of group LPC13Axx_SPI */

/*------------- RTC Timer (RTC) --------------------------------------------------*/
/** @addtogroup LPC13Axx_RTC LPC13Axx Comparator
  @{
*/
typedef struct {                            /*!< (@ 0x40028000) RTC Structure          */
  __IO uint32_t  CTRL;                      /*!< (@ 0x40028000) Alarm/Wakeup Timer Control register */
  __IO uint32_t  MATCH;                     /*!< (@ 0x40028004) Alarm/Wakeup TImer Match register */
  __IO uint32_t  COUNT;                     /*!< (@ 0x40028008) Alarm/Wakeup TImer counter register */
  __IO uint32_t  WAKE;                      /*!< (@ 0x4002800C) Alarm/Wakeup TImer Wakeup register */
} LPC_RTC_TypeDef;
/*@}*/ /* end of group LPC13Axx_RTC */


/*------------- Multi-Rate Timer(MRT) --------------------------------------------------*/
typedef struct {
  __IO uint32_t INTVAL;        							
  __IO uint32_t TIMER;         							
  __IO uint32_t CTRL;          							
  __IO uint32_t STAT;          							
} MRT_Channel_cfg_Type;

typedef struct {
  MRT_Channel_cfg_Type Channel[15]; 		
  __IO uint32_t PARAM; 				
  __IO uint32_t IDLE_CH; 			
  __IO uint32_t IRQ_FLAG; 		
  __IO uint32_t ID; 				
} LPC_MRT_TypeDef;


// ------------------------------------------------------------------------------------------------
// -----                                          ADC                                         -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC11U1x ADC Modification date=3/16/2011 Major revision=0 Minor revision=3  (ADC)
  */

typedef struct {                            /*!< (@ 0x40000000) ADC Structure          */
  __IO uint32_t CTRL;                       /*!< (@ 0x40000000) A/D Control Register */
  __IO uint32_t INPUTSEL;                   /*!< (@ 0x40000004) A/D Input Control Register */
  union {
  __IO uint32_t SEQ_CTRL[2];
		struct {
	__IO uint32_t SEQA_CTRL;                  /*!< (@ 0x40000008) A/D SEQA Ctrl Register */
	__IO uint32_t SEQB_CTRL;                  /*!< (@ 0x4000000C) A/D SEQB Ctrl Register */
		};
	};
  union {
  __IO uint32_t SEQ_GDAT[2];
		struct {	
	__IO uint32_t SEQA_GDAT;                  /*!< (@ 0x40000010) A/D SEQA Global Data Register */
	__IO uint32_t SEQB_GDAT;                  /*!< (@ 0x40000014) A/D SEQB Global Data Register */
		};
	};
       uint32_t Reserved[2];
  union {
  __I  uint32_t DAT[12];                    /*!< (@ 0x40000020) A/D Channel Data Register*/
    struct {
  __I  uint32_t DAT0;                       	/*!< (@ 0x40000020) A/D Channel Data Register 0*/
  __I  uint32_t DAT1;                       	/*!< (@ 0x40000024) A/D Channel Data Register 1*/
  __I  uint32_t DAT2;                       	/*!< (@ 0x40000028) A/D Channel Data Register 2*/
  __I  uint32_t DAT3;                       	/*!< (@ 0x4000002C) A/D Channel Data Register 3*/
  __I  uint32_t DAT4;                       	/*!< (@ 0x40000030) A/D Channel Data Register 4*/
  __I  uint32_t DAT5;                       	/*!< (@ 0x40000034) A/D Channel Data Register 5*/
  __I  uint32_t DAT6;                       	/*!< (@ 0x40000038) A/D Channel Data Register 6*/
  __I  uint32_t DAT7;                       	/*!< (@ 0x4000003C) A/D Channel Data Register 7*/
  __I  uint32_t DAT8;                       	/*!< (@ 0x40000040) A/D Channel Data Register 8*/
  __I  uint32_t DAT9;                       	/*!< (@ 0x40000044) A/D Channel Data Register 9*/
  __I  uint32_t DAT10;                      	/*!< (@ 0x40000048) A/D Channel Data Register 10*/
  __I  uint32_t DAT11;                      	/*!< (@ 0x4000004C) A/D Channel Data Register 11*/
		};
  };
  union {
  __IO uint32_t THR_LOW[2];
		struct {
  __IO uint32_t THR0_LOW;                  /*!< (@ 0x40000050) A/D Low Threhold Register 0. */
	__IO uint32_t THR1_LOW;                  /*!< (@ 0x40000054) A/D Low Threhold Register 1. */
		};
	};
  union {
  __IO uint32_t THR_HIGH[2];
		struct {
	__IO uint32_t THR0_HIGH;                 /*!< (@ 0x40000058) A/D High Threhold Register 0. */
	__IO uint32_t THR1_HIGH;                 /*!< (@ 0x4000005C) A/D High Threhold Register 1. */
		};
	};
	__IO uint32_t CHAN_THRSEL;               /*!< (@ 0x40000060) A/D Channel Threhold Select Register. */
	__IO uint32_t INTEN;                     /*!< (@ 0x40000064) A/D Interrupt Enable Register. */
	__IO uint32_t FLAGS;                     /*!< (@ 0x40000068) A/D Interrupt Request Flags Register. */
	__IO uint32_t TRM;                       /*!< (@ 0x4000006C) A/D Trim Register. */
} LPC_ADC_TypeDef;


// ------------------------------------------------------------------------------------------------
// -----                                          DAC                                         -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC13Axx D/A Converter Modification date=3/16/2011 Major revision=0 Minor revision=3  (PMU)
  */

