iarsystems/ewarm-nxp-example-projects/LPC15xx/EA-LPC1500/Blinky/Common/inc/lpc13Axx.h
typedef struct {                            /*!< (@ 0x40004000) DAC Structure          */
  __IO uint32_t  VAL;                       /*!< (@ 0x40004000) D/A control register   */
  __IO uint32_t  CTRL;                      /*!< (@ 0x40004004) D/A control register   */
  __IO uint32_t  CNTVAL;                    /*!< (@ 0x40004008) D/A control register   */
} LPC_DAC_TypeDef;


// ------------------------------------------------------------------------------------------------
// -----                                          QEI                                         -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10430 Chapter title=LPC18xx Quadrature Encoder Interface (QEI) Modification date=1/18/2011 Major revision=0 Minor revision=7  (QEI)
  */

typedef struct {                            /*!< (@ 0x40058000) QEI Structure          */
  __O  uint32_t CON;                        /*!< (@ 0x40058000) Control register       */
  __I  uint32_t STAT;                       /*!< (@ 0x40058004) Encoder status register */
  __IO uint32_t CONF;                       /*!< (@ 0x40058008) Configuration register */
  __I  uint32_t POS;                        /*!< (@ 0x4005800C) Position register      */
  __IO uint32_t MAXPOS;                     /*!< (@ 0x40058010) Maximum position register */
  __IO uint32_t CMPOS0;                     /*!< (@ 0x40058014) position compare register 0 */
  __IO uint32_t CMPOS1;                     /*!< (@ 0x40058018) position compare register 1 */
  __IO uint32_t CMPOS2;                     /*!< (@ 0x4005801C) position compare register 2 */
  __I  uint32_t INXCNT;                     /*!< (@ 0x40058020) Index count register   */
  __IO uint32_t INXCMP0;                    /*!< (@ 0x40058024) Index compare register 0 */
  __IO uint32_t LOAD;                       /*!< (@ 0x40058028) Velocity timer reload register */
  __I  uint32_t TIME;                       /*!< (@ 0x4005802C) Velocity timer register */
  __I  uint32_t VEL;                        /*!< (@ 0x40058030) Velocity counter register */
  __I  uint32_t CAP;                        /*!< (@ 0x40058034) Velocity capture register */
  __IO uint32_t VELCOMP;                    /*!< (@ 0x40058038) Velocity compare register */
  __IO uint32_t FILTERPHA;                  /*!< (@ 0x4005803C) Digital filter register on input phase A (QEI_A) */
  __IO uint32_t FILTERPHB;                  /*!< (@ 0x40058040) Digital filter register on input phase B (QEI_B) */
  __IO uint32_t FILTERINX;                  /*!< (@ 0x40058044) Digital filter register on input index (QEI_IDX) */
  __IO uint32_t WINDOW;                     /*!< (@ 0x40058048) Index acceptance window register */
  __IO uint32_t INXCMP1;                    /*!< (@ 0x4005804C) Index compare register 1 */
  __IO uint32_t INXCMP2;                    /*!< (@ 0x40058050) Index compare register 2 */
  __I  uint32_t RESERVED0[993];
  __O  uint32_t IEC;                        /*!< (@ 0x40058FD8) Interrupt enable clear register */
  __O  uint32_t IES;                        /*!< (@ 0x40058FDC) Interrupt enable set register */
  __I  uint32_t INTSTAT;                    /*!< (@ 0x40058FE0) Interrupt status register */
  __I  uint32_t IE;                         /*!< (@ 0x40058FE4) Interrupt enable register */
  __O  uint32_t CLR;                        /*!< (@ 0x40058FE8) Interrupt status clear register */
  __O  uint32_t SET;                        /*!< (@ 0x40058FEC) Interrupt status set register */
} LPC_QEI_TypeDef;


// ------------------------------------------------------------------------------------------------
// -----                                          PMU                                         -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC11U1x Power Management Unit (PMU) Modification date=3/16/2011 Major revision=0 Minor revision=3  (PMU)
  */

typedef struct {                            /*!< (@ 0x40038000) PMU Structure          */
  __IO uint32_t PCON;                       /*!< (@ 0x40038000) Power control register */
  union{
  __IO uint32_t GPREG[5];                   /*!< (@ 0x40038004) General purpose register 0 */
  struct{
  __IO uint32_t GPREG0;                   	/*!< (@ 0x40038004) General purpose register 0 */
  __IO uint32_t GPREG1;                   	/*!< (@ 0x40038008) General purpose register 1 */
  __IO uint32_t GPREG2;                   	/*!< (@ 0x4003800C) General purpose register 2 */
  __IO uint32_t GPREG3;                   	/*!< (@ 0x40038010) General purpose register 3 */
  __IO uint32_t GPREG4;                   	/*!< (@ 0x4003801C) General purpose register 4 */
  };
  };
} LPC_PMU_TypeDef;


/**
  * @brief Product name title=UM10462 Chapter title=LPC13Axx Flash programming firmware Major revision=0 Minor revision=3  (NVMC)
  */
typedef struct {                            /*!< (@ 0x40040000) NVMC Structure    */
  __I  uint32_t RESERVED0[4];
  __IO uint32_t FLASHCFG;                   /*!< (@ 0x40040010) Flash memory access time configuration register */
  __I  uint32_t RESERVED1[3];
  __IO uint32_t FMSSTART;                   /*!< (@ 0x40040020) Signature start address register */
  __IO uint32_t FMSSTOP;                    /*!< (@ 0x40040024) Signature stop-address register */
  __I  uint32_t RESERVED2[1];
  __I  uint32_t FMSW0;                      /*!< (@ 0x4004002C) Word 0 [31:0]          */
  __I  uint32_t FMSW1;                      /*!< (@ 0x40040030) Word 1 [63:32]         */
  __I  uint32_t FMSW2;                      /*!< (@ 0x40040034) Word 2 [95:64]         */
  __I  uint32_t FMSW3;                      /*!< (@ 0x40040038) Word 3 [127:96]        */
  __I  uint32_t RESERVED3[1001];
  __I  uint32_t FMSTAT;                     /*!< (@ 0x40040FE0) Signature generation status register */
  __I  uint32_t RESERVED4[1];
  __IO uint32_t FMSTATCLR;                  /*!< (@ 0x40040FE8) Signature generation status clear register */
} LPC_NVMC_TypeDef;
/*@}*/ /* end of group LPC13Axx_NVMC */

// ------------------------------------------------------------------------------------------------
// -----                                       IOCONFIG                                       -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC13Axx I/O configuration Modification date=3/16/2011 Major revision=0 Minor revision=3  (IOCONFIG)
  */

typedef struct {                            /*!< (@ 0x40044000) IOCONFIG Structure     */
  __IO uint32_t PIO0_0;                     /*!< (@ 0x40044000) I/O configuration for pin PIO0_0 */
  __IO uint32_t PIO0_1;                     /*!< (@ 0x40044004) I/O configuration for pin PIO0_1 */
  __IO uint32_t PIO0_2;                     /*!< (@ 0x40044008) I/O configuration for pin PIO0_2 */
  __IO uint32_t PIO0_3;                     /*!< (@ 0x4004400C) I/O configuration for pin PIO0_3 */
  __IO uint32_t PIO0_4;                     /*!< (@ 0x40044010) I/O configuration for pin PIO0_4 */
  __IO uint32_t PIO0_5;                     /*!< (@ 0x40044014) I/O configuration for pin PIO0_5 */
  __IO uint32_t PIO0_6;                     /*!< (@ 0x40044018) I/O configuration for pin PIO0_6 */
  __IO uint32_t PIO0_7;                     /*!< (@ 0x4004401C) I/O configuration for pin PIO0_7 */
  __IO uint32_t PIO0_8;                     /*!< (@ 0x40044020) I/O configuration for pin PIO0_8 */
  __IO uint32_t PIO0_9;                     /*!< (@ 0x40044024) I/O configuration for pin PIO0_9 */
  __IO uint32_t PIO0_10;                    /*!< (@ 0x40044028) I/O configuration for pin PIO0_10 */
  __IO uint32_t PIO0_11;                    /*!< (@ 0x4004402C) I/O configuration for pin PIO0_11 */
  __IO uint32_t PIO0_12;                    /*!< (@ 0x40044030) I/O configuration for pin PIO0_12 */
  __IO uint32_t PIO0_13;                    /*!< (@ 0x40044034) I/O configuration for pin PIO0_13 */
  __IO uint32_t PIO0_14;                    /*!< (@ 0x40044038) I/O configuration for pin PIO0_14 */
  __IO uint32_t PIO0_15;                    /*!< (@ 0x4004403C) I/O configuration for pin PIO0_15 */
  __IO uint32_t PIO0_16;                    /*!< (@ 0x40044040) I/O configuration for pin PIO0_16 */
  __IO uint32_t PIO0_17;                    /*!< (@ 0x40044044) I/O configuration for pin PIO0_17 */
  __IO uint32_t PIO0_18;                    /*!< (@ 0x40044048) I/O configuration for pin PIO0_18 */
  __IO uint32_t PIO0_19;                    /*!< (@ 0x4004404C) I/O configuration for pin PIO0_19 */
  __IO uint32_t PIO0_20;                    /*!< (@ 0x40044050) I/O configuration for pin PIO0_20 */
  __IO uint32_t PIO0_21;                    /*!< (@ 0x40044054) I/O configuration for pin PIO0_21 */
  __IO uint32_t PIO0_22;                    /*!< (@ 0x40044058) I/O configuration for pin PIO0_22 */
  __IO uint32_t PIO0_23;                    /*!< (@ 0x4004405C) I/O configuration for pin PIO0_23 */
  __IO uint32_t PIO0_24;                    /*!< (@ 0x40044060) I/O configuration for pin PIO0_24 */
  __IO uint32_t PIO0_25;                    /*!< (@ 0x40044064) I/O configuration for pin PIO0_25 */
  __IO uint32_t PIO0_26;                    /*!< (@ 0x40044068) I/O configuration for pin PIO0_26 */
  __IO uint32_t PIO0_27;                    /*!< (@ 0x4004406C) I/O configuration for pin PIO0_27 */
  __IO uint32_t PIO0_28;                    /*!< (@ 0x40044070) I/O configuration for pin PIO0_28 */
  __IO uint32_t PIO0_29;                    /*!< (@ 0x40044074) I/O configuration for pin PIO0_29 */
  __IO uint32_t PIO0_30;                    /*!< (@ 0x40044078) I/O configuration for pin PIO0_30 */
  __IO uint32_t PIO0_31;                    /*!< (@ 0x4004407C) I/O configuration for pin PIO0_31 */
  __IO uint32_t PIO1_0;                     /*!< Offset: 0x080 */
  __IO uint32_t PIO1_1;         
  __IO uint32_t PIO1_2;       
  __IO uint32_t PIO1_3;      
  __IO uint32_t PIO1_4;                     /*!< Offset: 0x090 */
  __IO uint32_t PIO1_5;                     
  __IO uint32_t PIO1_6;     
  __IO uint32_t PIO1_7;       
  __IO uint32_t PIO1_8;                     /*!< Offset: 0x0A0 */
  __IO uint32_t PIO1_9;        
  __IO uint32_t PIO1_10;        
  __IO uint32_t PIO1_11;       
  __IO uint32_t PIO1_12;                    /*!< Offset: 0x0B0 */
  __IO uint32_t PIO1_13;                   
  __IO uint32_t PIO1_14;                    
  __IO uint32_t PIO1_15;                    
  __IO uint32_t PIO1_16;                    /*!< (@ 0x400440C0) I/O configuration for pin PIO1_16 */
  __IO uint32_t PIO1_17;
  __IO uint32_t PIO1_18;
  __IO uint32_t PIO1_19;                    
  __IO uint32_t PIO1_20;                    /*!< (@ 0x400440D0) I/O configuration for pin PIO1_20 */
  __IO uint32_t PIO1_21;                    /*!< (@ 0x400440D4) I/O configuration for pin PIO1_21 */
  __IO uint32_t PIO1_22;                    /*!< (@ 0x400440D8) I/O configuration for pin PIO1_22 */
  __IO uint32_t PIO1_23;                    /*!< (@ 0x400440DC) I/O configuration for pin PIO1_23 */
  __IO uint32_t PIO1_24;                    /*!< (@ 0x400440E0) I/O configuration for pin PIO1_24 */
  __IO uint32_t PIO1_25;                    /*!< (@ 0x400440E4) I/O configuration for pin PIO1_25 */
  __IO uint32_t PIO1_26;                    /*!< (@ 0x400440E8) I/O configuration for pin PIO1_26 */
  __IO uint32_t PIO1_27;                    /*!< (@ 0x400440EC) I/O configuration for pin PIO1_27 */
  __IO uint32_t PIO1_28;                    /*!< (@ 0x400440F0) I/O configuration for pin PIO1_28 */
  __IO uint32_t PIO1_29;                    /*!< (@ 0x400440F4) I/O configuration for pin PIO1_29 */
  __IO uint32_t PIO1_30;                    /*!< (@ 0x400440FC) I/O configuration for pin PIO1_30 */
  __IO uint32_t PIO1_31;                    /*!< (@ 0x400440FC) I/O configuration for pin PIO1_31 */
  __IO uint32_t PIO2_0;                     /*!< (@ 0x40044100) I/O configuration for pin PIO2_0 */
  __IO uint32_t PIO2_1;                     /*!< (@ 0x40044104) I/O configuration for pin PIO2_1 */
  __IO uint32_t PIO2_2;                     /*!< (@ 0x40044108) I/O configuration for pin PIO2_2 */
  __IO uint32_t PIO2_3;                     /*!< (@ 0x4004410C) I/O configuration for pin PIO2_3 */
  __IO uint32_t PIO2_4;                     /*!< (@ 0x40044110) I/O configuration for pin PIO2_4 */
  __IO uint32_t PIO2_5;                     /*!< (@ 0x40044114) I/O configuration for pin PIO2_5 */
  __IO uint32_t PIO2_6;                     /*!< (@ 0x40044118) I/O configuration for pin PIO2_6 */
  __IO uint32_t PIO2_7;                     /*!< (@ 0x4004411C) I/O configuration for pin PIO2_7 */
  __IO uint32_t PIO2_8;                     /*!< (@ 0x40044120) I/O configuration for pin PIO2_8 */
  __IO uint32_t PIO2_9;                     /*!< (@ 0x40044124) I/O configuration for pin PIO2_9 */
  __IO uint32_t PIO2_10;                    /*!< (@ 0x40044128) I/O configuration for pin PIO2_10 */
  __IO uint32_t PIO2_11;                    /*!< (@ 0x4004412C) I/O configuration for pin PIO2_11 */
  __IO uint32_t PIO2_12;                    /*!< (@ 0x40044130) I/O configuration for pin PIO2_12 */
  __IO uint32_t PIO2_13;                    /*!< (@ 0x40044134) I/O configuration for pin PIO2_13 */
} LPC_IOCON_TypeDef;

// ------------------------------------------------------------------------------------------------
// -----                                       IOCONFIG                                       -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC13Axx I/O Mux configuration Modification date=3/16/2011 Major revision=0 Minor revision=3  (IOCONFIG)
  */

typedef struct {                            /*!< (@ 0x40014000) IOCONFIG Structure     */
  union{
  __IO uint32_t SCT0_P_MUX[8];                  
  struct{
  __IO uint32_t SCT0_P_MUX0;                   	
  __IO uint32_t SCT0_P_MUX1;                   	
  __IO uint32_t SCT0_P_MUX2;                   	
  __IO uint32_t SCT0_P_MUX3;                   	
  __IO uint32_t SCT0_P_MUX4;
  __IO uint32_t SCT0_P_MUX5;                   	
  __IO uint32_t SCT0_P_MUX6;                   	
  __IO uint32_t SCT0_P_MUX7; 		
  };
  };
  union{
  __IO uint32_t SCT1_P_MUX[8];                  
  struct{
  __IO uint32_t SCT1_P_MUX0;                   	
  __IO uint32_t SCT1_P_MUX1;                   	
  __IO uint32_t SCT1_P_MUX2;                   	
  __IO uint32_t SCT1_P_MUX3;                   	
  __IO uint32_t SCT1_P_MUX4;
  __IO uint32_t SCT1_P_MUX5;                   	
  __IO uint32_t SCT1_P_MUX6;                   	
  __IO uint32_t SCT1_P_MUX7; 		
  };
  };
  union{
  __IO uint32_t SCT2_P_MUX[8];                  
  struct{
  __IO uint32_t SCT2_P_MUX0;                   	
  __IO uint32_t SCT2_P_MUX1;                   	
  __IO uint32_t SCT2_P_MUX2;                   	
  __IO uint32_t SCT2_P_MUX3;                   	
  __IO uint32_t SCT2_P_MUX4;
  __IO uint32_t SCT2_P_MUX5;                   	
  __IO uint32_t SCT2_P_MUX6;                   	
  __IO uint32_t SCT2_P_MUX7; 		
  };
  };
  union{
  __IO uint32_t SCT3_P_MUX[8];                  
  struct{
  __IO uint32_t SCT3_P_MUX0;                   	
  __IO uint32_t SCT3_P_MUX1;                   	
  __IO uint32_t SCT3_P_MUX2;                   	
  __IO uint32_t SCT3_P_MUX3;                   	
  __IO uint32_t SCT3_P_MUX4;
  __IO uint32_t SCT3_P_MUX5;                   	
  __IO uint32_t SCT3_P_MUX6;                   	
  __IO uint32_t SCT3_P_MUX7; 		
  };
  };
	__I  uint32_t RESERVED0[16];
  union{
  __IO uint32_t GPIO_INT_P_MUX[8];                  
  struct{
  __IO uint32_t GPIO_INT_P_MUX0;                   	
  __IO uint32_t GPIO_INT_P_MUX1;                   	
  __IO uint32_t GPIO_INT_P_MUX2;                   	
  __IO uint32_t GPIO_INT_P_MUX3;                   	
  __IO uint32_t GPIO_INT_P_MUX4;
  __IO uint32_t GPIO_INT_P_MUX5;                   	
  __IO uint32_t GPIO_INT_P_MUX6;                   	
  __IO uint32_t GPIO_INT_P_MUX7; 		
  };
  };
  union{
  __IO uint32_t DMA0_ITRIG_P_MUX[8];                  
  struct{
  __IO uint32_t DMA0_ITRIG_P_MUX0;                   	
  __IO uint32_t DMA0_ITRIG_P_MUX1;                   	
  __IO uint32_t DMA0_ITRIG_P_MUX2;                   	
  __IO uint32_t DMA0_ITRIG_P_MUX3;                   	
  __IO uint32_t DMA0_ITRIG_P_MUX4;
  __IO uint32_t DMA0_ITRIG_P_MUX5;                   	
  __IO uint32_t DMA0_ITRIG_P_MUX6;                   	
  __IO uint32_t DMA0_ITRIG_P_MUX7; 		
  };
  };
  union{
  __IO uint32_t DMA1_ITRIG_P_MUX[8];                  
  struct{
  __IO uint32_t DMA1_ITRIG_P_MUX0;                   	
  __IO uint32_t DMA1_ITRIG_P_MUX1;                   	
  __IO uint32_t DMA1_ITRIG_P_MUX2;                   	
  __IO uint32_t DMA1_ITRIG_P_MUX3;                   	
  __IO uint32_t DMA1_ITRIG_P_MUX4;
  __IO uint32_t DMA1_ITRIG_P_MUX5;                   	
  __IO uint32_t DMA1_ITRIG_P_MUX6;                   	
  __IO uint32_t DMA1_ITRIG_P_MUX7; 		
  };
  };
  union{
  __IO uint32_t DMA2_ITRIG_P_MUX[8];                  
  struct{
  __IO uint32_t DMA2_ITRIG_P_MUX0;                   	
  __IO uint32_t DMA2_ITRIG_P_MUX1;                   	
  __IO uint32_t DMA2_ITRIG_P_MUX2;                   	
  __IO uint32_t DMA2_ITRIG_P_MUX3;                   	
  __IO uint32_t DMA2_ITRIG_P_MUX4;
  __IO uint32_t DMA2_ITRIG_P_MUX5;                   	
  __IO uint32_t DMA2_ITRIG_P_MUX6;                   	
  __IO uint32_t DMA2_ITRIG_P_MUX7; 		
  };
  };
  union{
  __IO uint32_t DMA_OTIRG_P_MUX[8];                  
  struct{
  __IO uint32_t DMA_OTIRG_P_MUX0;                   	
  __IO uint32_t DMA_OTIRG_P_MUX1;                   	
  __IO uint32_t DMA_OTIRG_P_MUX2;                   	
  __IO uint32_t DMA_OTIRG_P_MUX3;                   	
  __IO uint32_t DMA_OTIRG_P_MUX4;
  __IO uint32_t DMA_OTIRG_P_MUX5;                   	
  __IO uint32_t DMA_OTIRG_P_MUX6;                   	
  __IO uint32_t DMA_OTIRG_P_MUX7; 		
  };
  };
  union{
  __IO uint32_t FREQ_ME_P_MUX[8];                  
  struct{
  __IO uint32_t FREQ_ME_P_MUX0;                   	
  __IO uint32_t FREQ_ME_P_MUX1;                   	
  __IO uint32_t FREQ_ME_P_MUX2;                   	
  __IO uint32_t FREQ_ME_P_MUX3;                   	
  __IO uint32_t FREQ_ME_P_MUX4;
  __IO uint32_t FREQ_ME_P_MUX5;                   	
  __IO uint32_t FREQ_ME_P_MUX6;                   	
  __IO uint32_t FREQ_ME_P_MUX7; 		
  };
  };
} LPC_PMUX_TypeDef;

// ------------------------------------------------------------------------------------------------
// -----                                        SYSCON                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC13Axx System control block Modification date=3/16/2011 Major revision=0 Minor revision=3  (SYSCON)
  */

