iarsystems/ewarm-nxp-example-projects/LPC15xx/EA-LPC1500/Blinky/Common/inc/lpc13Axx.h
typedef struct
{
  volatile unsigned int SYSMEMREMAP                              ; // (0x000)
  volatile unsigned int AHBMATPRIO                               ; // (0x004)
  volatile unsigned int AHBFUNPRIO                               ; // (0x008)
  volatile unsigned int AHBBUFEN0                                ; // (0x00C)
  volatile unsigned int AHBBUFEN1                                ; // (0x010)
  volatile unsigned int SYSTCKCAL                                ; // (0x014)
  volatile unsigned int IRQLATENCY                               ; // (0x018)
  volatile unsigned int NMISRC                                   ; // (0x01C)
  volatile unsigned int RESERVED1[8]                             ; 
  volatile unsigned int SYSRESSTAT                               ; // (0x040)
  volatile unsigned int PRESETCTRL0                              ; // (0x044)
  volatile unsigned int PRESETCTRL1                              ; // (0x048)
  volatile unsigned int PIOPORCAP0                               ; // (0x04C)
  volatile unsigned int PIOPORCAP1                               ; // (0x050)
  volatile unsigned int PIOPORCAP2                               ; // (0x054)
  volatile unsigned int RESERVED2[10]                             ; 
  volatile unsigned int MAINCLKSELA                              ; // (0x080)
  volatile unsigned int MAINCLKSELB                              ; // (0x084)
  volatile unsigned int USBCLKSEL                                ; // (0x088)
  volatile unsigned int ADCASYNCCLKSEL                           ; // (0x08C)
  volatile unsigned int RESERVED3                                ; 
  volatile unsigned int CLKOUTCLKSELA                            ; // (0x094)
  volatile unsigned int CLKOUTCLKSELB                            ; // (0x098)
  volatile unsigned int SPIFICLKSEL                              ; // (0x09C)
  volatile unsigned int SYSPLLCLKSEL                             ; // (0x0A0)
  volatile unsigned int USBPLLCLKSEL                             ; // (0x0A4)
  volatile unsigned int SCTPLLCLKSEL                             ; // (0x0A8)
  volatile unsigned int RESERVED4[5]                              ; 
  volatile unsigned int SYSAHBCLKDIV                             ; // (0x0C0)
  volatile unsigned int SYSAHBCLKCTRL0                           ; // (0x0C4)
  volatile unsigned int SYSAHBCLKCTRL1                           ; // (0x0C8)
  volatile unsigned int SYSTICKCLKDIV                            ; // (0x0CC)
  volatile unsigned int FRGCLKDIV                                ; // (0x0D0)
  volatile unsigned int DFCLKDIV                                 ; // (0x0D4)
  volatile unsigned int TRACECLKDIV                              ; // (0x0D8)
  volatile unsigned int RESERVED5[4]                             ; 
  volatile unsigned int USBCLKDIV                                ; // (0x0EC)
  volatile unsigned int ADCASYNCCLKDIV                           ; // (0x0F0)
  volatile unsigned int RESERVED6                                ; 
  volatile unsigned int CLKOUTDIV                                ; // (0x0F8)
  volatile unsigned int SPIFICLKDIV                              ; // (0x0FC)
  volatile unsigned int RESERVED7[8]                             ; 
  volatile unsigned int FREQMECTRL                               ; // (0x120)
  volatile unsigned int FLASHCFG                                 ; // (0x124)
  volatile unsigned int FRGCTRL                                  ; // (0x128)
  volatile unsigned int USBCLKCTRL                               ; // (0x12C)
  volatile unsigned int USBCLKSTAT                               ; // (0x130)
  volatile unsigned int EZHINT                                   ; // (0x134)
  volatile unsigned int SCRATCHREG0                              ; // (0x138)
  volatile unsigned int SCRATCHREG1                              ; // (0x13C)
  volatile unsigned int SCRATCHREG2                              ; // (0x140)
  volatile unsigned int SCRATCHREG3                              ; // (0x144)
  volatile unsigned int RESERVED8[14]                            ; 
  volatile unsigned int BODCTRL                                  ; // (0x180)
  volatile unsigned int IRCCTRL                                  ; // (0x184)
  volatile unsigned int SYSOSCCTRL                               ; // (0x188)
  volatile unsigned int WDTOSCCTRL                               ; // (0x18C)
  volatile unsigned int RTCOSCCTRL                               ; // (0x190)
  volatile unsigned int PVTDCTRL                                 ; // (0x194)
  volatile unsigned int SYSPLLCTRL                               ; // (0x198)
  volatile unsigned int SYSPLLSTAT                               ; // (0x19C)
  volatile unsigned int USBPLLCTRL                               ; // (0x1A0)
  volatile unsigned int USBPLLSTAT                               ; // (0x1A4)
  volatile unsigned int SCTPLLCTRL                               ; // (0x1A8)
  volatile unsigned int SCTPLLSTAT                               ; // (0x1AC)
  volatile unsigned int RESERVED9[20]                            ; 
  volatile unsigned int PDSLEEPCFG                               ; // (0x200)
  volatile unsigned int PDAWAKECFG                               ; // (0x204)
  volatile unsigned int PDRUNCFG                                 ; // (0x208)
  volatile unsigned int RESERVED10[3]                            ; 
  volatile unsigned int STARTERP0                                ; // (0x218)
  volatile unsigned int STARTERP1                                ; // (0x21C)
  volatile unsigned int RESERVED11[54]                           ; 
  volatile unsigned int PDSAFTY                                  ; // (0x2F8)
  volatile unsigned int MAINCLKSAFETY                            ; // (0x2FC)
  volatile unsigned int RESERVED12[32]                           ; 
  volatile unsigned int ROMWSCTRL                                ; // (0x380)
  volatile unsigned int AUTOCGOR                                 ; // (0x384)
  volatile unsigned int GPIOPSYNC                                ; // (0x388)
  volatile unsigned int FMCRDDELAY                               ; // (0x38C)
  volatile unsigned int REGVCTRL0                                ; // (0x390)
  volatile unsigned int REGVCTRL1                                ; // (0x394)
  volatile unsigned int REGVPROT                                 ; // (0x398)
  volatile unsigned int FLASHREFCLKEN                            ; // (0x39C)
  volatile unsigned int RESERVED13[4]                            ; 
  volatile unsigned int DIE_ID                                   ; // (0x3B0)
  volatile unsigned int RESERVED14[9]                            ; 
  volatile unsigned int DEVCFGEESIZE                             ; // (0x3D8)
  volatile unsigned int DEVCFGROMSIZE                            ; // (0x3DC)
  volatile unsigned int DEVCFGFLASHSIZE                          ; // (0x3E0)
  volatile unsigned int DEVCFGLOCK                               ; // (0x3E4)
  volatile unsigned int DEVCFGRAMSIZE                            ; // (0x3E8)
  volatile unsigned int DEVCFGPERIPH                             ; // (0x3EC)
  volatile unsigned int DEVCFGSECPORT                            ; // (0x3F0)
  volatile unsigned int JTAG_IDCODE                              ; // (0x3F4)
  volatile unsigned int DEVICE_ID0                               ; // (0x3F8)
  volatile unsigned int DEVICE_ID1                               ; // (0x3FC)
} LPC_SYSCON_TypeDef;


/*------------- Switch Matrix Port --------------------------*/
/** @addtogroup LPC13Axx_SWM LPC13Axx Switch Matrix Port 
  @{
*/
typedef struct
{
  union {
    __IO uint32_t PINASSIGN[16];
    struct {
      __IO uint32_t PINASSIGN0;
      __IO uint32_t PINASSIGN1;
      __IO uint32_t PINASSIGN2;
      __IO uint32_t PINASSIGN3;
      __IO uint32_t PINASSIGN4;
      __IO uint32_t PINASSIGN5;
      __IO uint32_t PINASSIGN6;
      __IO uint32_t PINASSIGN7;
      __IO uint32_t PINASSIGN8;
      __IO uint32_t PINASSIGN9;
      __IO uint32_t PINASSIGN10;
      __IO uint32_t PINASSIGN11;
      __IO uint32_t PINASSIGN12;
      __IO uint32_t PINASSIGN13;
      __IO uint32_t PINASSIGN14;
      __IO uint32_t PINASSIGN15;
    };
  };
  __I  uint32_t RESERVED0[96];
	union {
    __IO uint32_t PINENABLE[2];					/* Also known as fixed pin */
    struct {
      __IO uint32_t PINENABLE0;
      __IO uint32_t PINENABLE1;
    };
  };
} LPC_SWM_TypeDef;
/*@}*/ /* end of group LPC13Axx_SWM */


// ------------------------------------------------------------------------------------------------
// -----                                       GPIO_PORT                                      -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10462 Chapter title=LPC13Axx GPIO Modification date=3/17/2011 Major revision=0 Minor revision=3  (GPIO_PORT)
  */

