iarsystems/ewarm-nxp-example-projects/LPC15xx/EA-LPC1500/Blinky/Common/inc/lpc13Axx.h
typedef struct {                            
  union {
    struct {
      __IO uint8_t B0[32];                       /*!< (@ 0xA0000000) Byte pin registers port 0; pins PIO0_0 to PIO0_31 */
      __IO uint8_t B1[32];                       /*!< (@ 0xA0000020) Byte pin registers port 1 */
    };
    __IO uint8_t B[64];                       /*!< (@ 0xA0000000) Byte pin registers port 0/1 */
  };
  __I  uint32_t RESERVED0[1008];
  union {
    struct {
      __IO uint32_t W0[32];                      /*!< (@ 0xA0001000) Word pin registers port 0 */
      __IO uint32_t W1[32];                      /*!< (@ 0xA0001080) Word pin registers port 1 */
    };
    __IO uint32_t W[64];                       /*!< (@ 0xA0001000) Word pin registers port 0/1 */
  };
       uint32_t RESERVED1[960];
  __IO uint32_t DIR[2];			/* 0x2000 */
       uint32_t RESERVED2[30];
  __IO uint32_t MASK[2];		/* 0x2080 */
       uint32_t RESERVED3[30];
  __IO uint32_t PIN[2];			/* 0x2100 */
       uint32_t RESERVED4[30];
  __IO uint32_t MPIN[2];		/* 0x2180 */
       uint32_t RESERVED5[30];
  __IO uint32_t SET[2];			/* 0x2200 */
       uint32_t RESERVED6[30];
  __O  uint32_t CLR[2];			/* 0x2280 */
       uint32_t RESERVED7[30];
  __O  uint32_t NOT[2];			/* 0x2300 */
} LPC_GPIO_TypeDef;


// ------------------------------------------------------------------------------------------------
// -----                                     GPIO_INT                                     -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief Product name title=UM10462 Chapter title=LPC13Axx GPIO Modification date=3/17/2011 Major revision=0 Minor revision=3  (GPIO_INT)
  */

typedef struct {                            /*!< (@ 0xA0004000) GPIO_PIN_INT Structure */
  __IO uint32_t ISEL;                       /*!< (@ 0xA0004000) Pin Interrupt Mode register */
  __IO uint32_t IENR;                       /*!< (@ 0xA0004004) Pin Interrupt Enable (Rising) register */
  __IO uint32_t SIENR;                      /*!< (@ 0xA0004008) Set Pin Interrupt Enable (Rising) register */
  __IO uint32_t CIENR;                      /*!< (@ 0xA000400C) Clear Pin Interrupt Enable (Rising) register */
  __IO uint32_t IENF;                       /*!< (@ 0xA0004010) Pin Interrupt Enable Falling Edge / Active Level register */
  __IO uint32_t SIENF;                      /*!< (@ 0xA0004014) Set Pin Interrupt Enable Falling Edge / Active Level register */
  __IO uint32_t CIENF;                      /*!< (@ 0xA0004018) Clear Pin Interrupt Enable Falling Edge / Active Level address */
  __IO uint32_t RISE;                       /*!< (@ 0xA000401C) Pin Interrupt Rising Edge register */
  __IO uint32_t FALL;                       /*!< (@ 0xA0004020) Pin Interrupt Falling Edge register */
  __IO uint32_t IST;                        /*!< (@ 0xA0004024) Pin Interrupt Status register */
  __IO uint32_t PMCTRL;                     /*!< (@ 0xA0004028) GPIO pattern match interrupt control register          */
  __IO uint32_t PMSRC;                      /*!< (@ 0xA000402C) GPIO pattern match interrupt bit-slice source register */
  __IO uint32_t PMCFG;                      /*!< (@ 0xA0004030) GPIO pattern match interrupt bit slice configuration register */
} LPC_GPIO_INT_TypeDef;


/*------------- CRC Engine (CRC) -----------------------------------------*/
/** @addtogroup LPC13Axx_CRC LPC13Axx Comparator
  @{
*/
typedef struct
{
  __IO uint32_t MODE;
  __IO uint32_t SEED;
  union {
  __I  uint32_t SUM;
  __O  uint32_t WR_DATA_DWORD;
  __O  uint16_t WR_DATA_WORD;
       uint16_t RESERVED_WORD;
  __O  uint8_t WR_DATA_BYTE;
       uint8_t RESERVED_BYTE[3];
  };
} LPC_CRC_TypeDef;
/*@}*/ /* end of group LPC13Axx_CRC */

/*------------- Comparator (CMP) --------------------------------------------------*/
/** @addtogroup LPC13Axx_CMP LPC13Axx Comparator
  @{
*/
typedef struct {
  __IO uint32_t CTRL;         // (0x00) 
	union {
    __IO uint32_t CMP[4];
    __IO uint32_t CMPFILTR[4];
    struct {		
      __IO uint32_t CMP0;         // (0x04)
      __IO uint32_t CMPFILTR0;    // (0x08)
      __IO uint32_t CMP1;         // (0x0C)
      __IO uint32_t CMPFILTR1;    // (0x10)
      __IO uint32_t CMP2;         // (0x14)
      __IO uint32_t CMPFILTR2;    // (0x18)
      __IO uint32_t CMP3;         // (0x1C)
      __IO uint32_t CMPFILTR3;    // (0x20)
		};
	};
} LPC_COMP_TypeDef;

/*@}*/ /* end of group LPC13Axx_CMP */


// ------------------------------------------------------------------------------------------------
// -----                                    GPIO_GROUP_INT0/1                                   -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC13Axx GPIO Modification date=3/17/2011 Major revision=0 Minor revision=3  (GPIO_GROUP_INT0)
  */

typedef struct {                            /*!< (@ 0x4005C000) GPIO_GROUP_INT0 Structure */
  __IO uint32_t CTRL;                       /*!< (@ 0x4005C000) GPIO grouped interrupt control register */
  __I  uint32_t RESERVED0[7];
  __IO uint32_t PORT_POL[2];                /*!< (@ 0x4005C020) GPIO grouped interrupt port 0 polarity register */
  __I  uint32_t RESERVED1[6];
  __IO uint32_t PORT_ENA[2];                /*!< (@ 0x4005C040) GPIO grouped interrupt port 0/1 enable register */
} LPC_GPIO_GROUP_INTx_Type;



// ------------------------------------------------------------------------------------------------
// -----                                          USB                                         -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief Product name title=UM10462 Chapter title=LPC13Axx USB2.0device controller Modification date=3/16/2011 Major revision=0 Minor revision=3  (USB)
  */

typedef struct {                            /*!< (@ 0x40080000) USB Structure          */
  __IO uint32_t DEVCMDSTAT;                 /*!< (@ 0x40080000) USB Device Command/Status register */
  __IO uint32_t INFO;                       /*!< (@ 0x40080004) USB Info register      */
  __IO uint32_t EPLISTSTART;                /*!< (@ 0x40080008) USB EP Command/Status List start address */
  __IO uint32_t DATABUFSTART;               /*!< (@ 0x4008000C) USB Data buffer start address */
  __IO uint32_t LPM;                        /*!< (@ 0x40080010) Link Power Management register */
  __IO uint32_t EPSKIP;                     /*!< (@ 0x40080014) USB Endpoint skip      */
  __IO uint32_t EPINUSE;                    /*!< (@ 0x40080018) USB Endpoint Buffer in use */
  __IO uint32_t EPBUFCFG;                   /*!< (@ 0x4008001C) USB Endpoint Buffer Configuration register */
  __IO uint32_t INTSTAT;                    /*!< (@ 0x40080020) USB interrupt status register */
  __IO uint32_t INTEN;                      /*!< (@ 0x40080024) USB interrupt enable register */
  __IO uint32_t INTSETSTAT;                 /*!< (@ 0x40080028) USB set interrupt status register */
  __IO uint32_t INTROUTING;                 /*!< (@ 0x4008002C) USB interrupt routing register */
  __I  uint32_t RESERVED0[1];
  __I  uint32_t EPTOGGLE;                   /*!< (@ 0x40080034) USB Endpoint toggle register */
} LPC_USB_TypeDef;

/*------------- CAN Controller (CAN) ----------------------------*/
/** @addtogroup LPC13Axx_CAN LPC13Axx Controller Area Network(CAN) 
  @{
*/
typedef struct
{
  __IO uint32_t CNTL;				/* 0x000 */
  __IO uint32_t STAT;
  __IO uint32_t EC;
  __IO uint32_t BT;
  __IO uint32_t INT;
  __IO uint32_t TEST;
  __IO uint32_t BRPE;
       uint32_t RESERVED0;
  __IO uint32_t IF1_CMDREQ;			/* 0x020 */
  __IO uint32_t IF1_CMDMSK;
  __IO uint32_t IF1_MSK1;
  __IO uint32_t IF1_MSK2;
  __IO uint32_t IF1_ARB1;
  __IO uint32_t IF1_ARB2;
  __IO uint32_t IF1_MCTRL;
  __IO uint32_t IF1_DA1;
  __IO uint32_t IF1_DA2;
  __IO uint32_t IF1_DB1;
  __IO uint32_t IF1_DB2;
       uint32_t RESERVED1[13];   
  __IO uint32_t IF2_CMDREQ;			/* 0x080 */
  __IO uint32_t IF2_CMDMSK;
  __IO uint32_t IF2_MSK1;
  __IO uint32_t IF2_MSK2;
  __IO uint32_t IF2_ARB1;
  __IO uint32_t IF2_ARB2;
  __IO uint32_t IF2_MCTRL;
  __IO uint32_t IF2_DA1;
  __IO uint32_t IF2_DA2;
  __IO uint32_t IF2_DB1;
  __IO uint32_t IF2_DB2;
       uint32_t RESERVED2[21];
  __I  uint32_t TXREQ1;				/* 0x100 */
  __I  uint32_t TXREQ2;
       uint32_t RESERVED3[6];
  __I  uint32_t ND1;				/* 0x120 */
  __I  uint32_t ND2;
       uint32_t RESERVED4[6];
  __I  uint32_t IR1;				/* 0x140 */
  __I  uint32_t IR2;
       uint32_t RESERVED5[6];
  __I  uint32_t MSGV1;				/* 0x160 */
  __I  uint32_t MSGV2;
       uint32_t RESERVED6[6];
  __IO uint32_t CLKDIV;				/* 0x180 */
} LPC_CAN_TypeDef;
/*@}*/ /* end of group LPC13Axx_CAN */

/*------------- DMA Controller (DMA) ----------------------------*/
/** @addtogroup LPC13Axx_DMA LPC13Axx DMA Controller(DNA) 
  @{
*/
typedef struct {                            /*!< (@ 0x4004C000) SDMA Structure    */
  __IO uint32_t CTRL;					/* 0x00 */                    
  __I  uint32_t INTSTAT;                   
  __IO uint32_t SRAMBASE;
       uint32_t RESERVED0[3];                
  __IO uint32_t BUFEN0;					/* 0x18 */          
  __IO uint32_t BUFEN1;       
  __IO uint32_t ENABLESET0;				/* 0x20 */           
  __IO uint32_t ENABLESET1;
  __O  uint32_t ENABLECLR0;
  __O  uint32_t ENABLECLR1;
  __I  uint32_t ACTIVE0;					/* 0x30 */        
  __I  uint32_t ACTIVE1;        
  __I  uint32_t BUSY0;      
  __I  uint32_t BUSY1;    
  __IO uint32_t ERRINT0;					/* 0x40 */        
  __IO uint32_t ERRINT1;    
  __IO uint32_t INTENSET0;         
  __IO uint32_t INTENSET1;
  __O  uint32_t INTENCLR0;				/* 0x50 */         
  __O  uint32_t INTENCLR1;
  __IO uint32_t INTA0;        
  __IO uint32_t INTA1;        
  __IO uint32_t INTB0;					/* 0x60 */      
  __IO uint32_t INTB1;
  __O  uint32_t SETVALID0;         
  __O  uint32_t SETVALID1;
  __O  uint32_t SETTRIG0;				/* 0x70 */        
  __O  uint32_t SETTRIG1;        
  __O  uint32_t ABORT0;      
  __O  uint32_t ABORT1;			 			           
} LPC_DMA_TypeDef;

typedef struct
{
  volatile unsigned int CFG;          // 0x000
  volatile unsigned int CTLSTAT;      // 0x004
  volatile unsigned int XFERCFG;      // 0x008
  volatile unsigned int RESERVED;        // 0x00C
} LPC_DMA_Channel;

/*@}*/ /* end of group LPC13Axx_DMA */

#if defined ( __CC_ARM   )
  #pragma no_anon_unions
#endif

/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/* Base addresses                                                             */
#define LPC_FLASH_BASE        (0x00000000UL)
#define LPC_RAM0_BASE         (0x02000000UL)
#define LPC_RAM1_BASE         (0x02400000UL)
#define LPC_RAM2_BASE         (0x02800000UL)
#define LPC_ROM_BASE          (0x03000000UL)
#define LPC_APB0_BASE         (0x40000000UL)
#define LPC_AHB_BASE          (0x10000000UL)

/* APB0 peripherals */
#define LPC_ADC0_BASE         (LPC_APB0_BASE + 0x00000)
#define LPC_DAC_BASE          (LPC_APB0_BASE + 0x04000)
#define LPC_CMP_BASE          (LPC_APB0_BASE + 0x08000)
#define LPC_PMUX_BASE         (LPC_APB0_BASE + 0x14000)
#define LPC_RTC_BASE          (LPC_APB0_BASE + 0x28000)
#define LPC_WWDT_BASE         (LPC_APB0_BASE + 0x2C000)
#define LPC_SWM_BASE          (LPC_APB0_BASE + 0x38000)
#define LPC_PMU_BASE          (LPC_APB0_BASE + 0x3C000)
#define LPC_UART0_BASE        (LPC_APB0_BASE + 0x40000)
#define LPC_UART1_BASE        (LPC_APB0_BASE + 0x44000)
#define LPC_LSPI0_BASE        (LPC_APB0_BASE + 0x48000)
#define LPC_LSPI1_BASE        (LPC_APB0_BASE + 0x4C000)
#define LPC_I2C_BASE          (LPC_APB0_BASE + 0x50000)
#define LPC_QEI_BASE          (LPC_APB0_BASE + 0x58000)
#define LPC_SYSCON_BASE       (LPC_APB0_BASE + 0x74000)

/* APB1 peripherals */
#define LPC_ADC1_BASE         (LPC_APB0_BASE + 0x80000)
#define LPC_MRT_BASE          (LPC_APB0_BASE + 0xA0000)
#define LPC_GPIO_INT_BASE     (LPC_APB0_BASE + 0xA4000)
#define LPC_GRP0_INT_BASE     (LPC_APB0_BASE + 0xA8000)
#define LPC_GRP1_INT_BASE     (LPC_APB0_BASE + 0xAC000)

#define LPC_RIT_BASE          (LPC_APB0_BASE + 0xB4000)
#define LPC_SCTIPU_BASE       (LPC_APB0_BASE + 0xB8000)
#define LPC_FMC_BASE          (LPC_APB0_BASE + 0xBC000)
#define LPC_UART2_BASE        (LPC_APB0_BASE + 0xC0000)
#define LPC_PVT_BASE          (LPC_APB0_BASE + 0xE8000)
#define LPC_CAN_BASE          (LPC_APB0_BASE + 0xF0000)
#define LPC_IOCON_BASE        (LPC_APB0_BASE + 0xF8000)
#define LPC_EECTRL_BASE       (LPC_APB0_BASE + 0xFC000)

/* AHB peripherals                                                            */
#define LPC_NVMC_BASE        (LPC_FLASH_BASE + 0x01000000)
#define LPC_EE_BASE          (LPC_FLASH_BASE + 0x03200000)

#define LPC_GPIO_BASE        (LPC_AHB_BASE + 0x0C000000)
#define LPC_USB_BASE         (LPC_AHB_BASE + 0x0C00C000)
#define LPC_CRC_BASE         (LPC_AHB_BASE + 0x0C010000)
#define LPC_SCT0_BASE        (LPC_AHB_BASE + 0x0C018000)
#define LPC_SCT1_BASE        (LPC_AHB_BASE + 0x0C01C000)
#define LPC_SCT2_BASE        (LPC_AHB_BASE + 0x0C020000)
#define LPC_SCT3_BASE        (LPC_AHB_BASE + 0x0C024000)

#define LPC_DMA_BASE         (LPC_AHB_BASE + 0x0C004000)
#define LPC_DMA_CH_BASE     ( LPC_DMA_BASE + 0x00000400)

/******************************************************************************/
/*                         Peripheral declaration                             */
/******************************************************************************/
#define LPC_WWDT              ((LPC_WWDT_TypeDef   *) LPC_WWDT_BASE  )
#define LPC_RIT               ((LPC_RIT_TypeDef    *) LPC_RIT_BASE   )
#define LPC_MRT               ((LPC_MRT_TypeDef    *) LPC_MRT_BASE   )
#define LPC_ADC0              ((LPC_ADC_TypeDef    *) LPC_ADC0_BASE  )
#define LPC_ADC1              ((LPC_ADC_TypeDef    *) LPC_ADC1_BASE  )
#define LPC_DAC               ((LPC_DAC_TypeDef    *) LPC_DAC_BASE   )

#define LPC_RTC               ((LPC_RTC_TypeDef    *) LPC_RTC_BASE   )
#define LPC_SWM               ((LPC_SWM_TypeDef    *) LPC_SWM_BASE   )
#define LPC_PMU               ((LPC_PMU_TypeDef    *) LPC_PMU_BASE   )
#define LPC_CMP               ((LPC_COMP_TypeDef   *) LPC_CMP_BASE   )
#define LPC_PMUX              ((LPC_PMUX_TypeDef   *) LPC_PMUX_BASE  )

#define LPC_NVMC              ((LPC_NVMC_TypeDef   *) LPC_NVMC_BASE  )
#define LPC_IOCON             ((LPC_IOCON_TypeDef  *) LPC_IOCON_BASE )
#define LPC_SYSCON            ((LPC_SYSCON_TypeDef *) LPC_SYSCON_BASE)
#define LPC_I2C               ((LPC_I2C_TypeDef    *) LPC_I2C_BASE   )
#define LPC_QEI               ((LPC_QEI_TypeDef    *) LPC_QEI_BASE   )
#define LPC_CAN               ((LPC_CAN_TypeDef    *) LPC_CAN_BASE   )
#define LPC_SPI0              ((LPC_SPI_TypeDef    *) LPC_LSPI0_BASE  )
#define LPC_SPI1              ((LPC_SPI_TypeDef    *) LPC_LSPI1_BASE  )
#define LPC_UART0             ((LPC_UART_TypeDef   *) LPC_UART0_BASE )
#define LPC_UART1             ((LPC_UART_TypeDef   *) LPC_UART1_BASE )
#define LPC_UART2             ((LPC_UART_TypeDef   *) LPC_UART2_BASE )

#define LPC_CRC               ((LPC_CRC_TypeDef    *) LPC_CRC_BASE   )
#define LPC_SCT0              ((LPC_SCT_TypeDef    *) LPC_SCT0_BASE   )
#define LPC_SCT1              ((LPC_SCT_TypeDef    *) LPC_SCT1_BASE   )
#define LPC_SCT2              ((LPC_SCT_TypeDef    *) LPC_SCT2_BASE   )
#define LPC_SCT3              ((LPC_SCT_TypeDef    *) LPC_SCT3_BASE   )

#define LPC_USB               ((LPC_USB_TypeDef    *) LPC_USB_BASE   )

