iarsystems/ewarm-nxp-example-projects/LPC15xx/EA-LPC1500/Blinky/Common/inc/lpc13Axx.h
#define LPC_GPIO              ((LPC_GPIO_TypeDef   *) LPC_GPIO_BASE  )
#define LPC_GPIO_PIN_INT      ((LPC_GPIO_INT_TypeDef   *) LPC_GPIO_INT_BASE  )
#define LPC_GPIO_GROUP_INT0   ((LPC_GPIO_GROUP_INTx_Type *) LPC_GRP0_INT_BASE  )
#define LPC_GPIO_GROUP_INT1   ((LPC_GPIO_GROUP_INTx_Type *) LPC_GRP1_INT_BASE  )

#define LPC_DMA               ((LPC_DMA_TypeDef    *) LPC_DMA_BASE   )
#define LPC_DMA_CH(i)         ((LPC_DMA_Channel    *)(LPC_DMA_CH_BASE + (i) * 4 * 4))


/* AHB/APB Clock 0 enable bits for peripherals on H2 */
#define     EN0_ROM0        (1<<1)
#define     EN0_RAM1        (1<<3)
#define     EN0_RAM2        (1<<4)
#define     EN0_FLASH       (1<<7)
#define     EN0_FMC         (1<<8)
#define     EN0_EE          (1<<9)
#define     EN0_P_MUX       (1<<11)
#define     EN0_SWM         (1<<12)
#define     EN0_IOCON       (1<<13)
#define     EN0_GPIO0       (1<<14)
#define     EN0_GPIO1       (1<<15)
#define     EN0_GPIO2       (1<<16)
#define     EN0_GPIO_INT    (1<<18)
#define     EN0_GPIO_GINT   (1<<19)
#define     EN0_DMA         (1<<20)
#define     EN0_CRC         (1<<21)
#define     EN0_WDT         (1<<22)
#define     EN0_RTC         (1<<23)
#define     EN0_ADC0        (1<<27)
#define     EN0_ADC1        (1<<28)
#define     EN0_DAC0        (1<<29)
#define     EN0_COMP        (1<<30)

/* AHB/APB Clock 1 enable bits for peripherals on H2 */
#define     EN1_MRT         (1<<0)
#define     EN1_RIT         (1<<1)
#define     EN1_SCT0        (1<<2)
#define     EN1_SCT1        (1<<3)
#define     EN1_SCT2        (1<<4)
#define     EN1_SCT3        (1<<5)
#define     EN1_CAN         (1<<7)
#define     EN1_SPI0        (1<<9)
#define     EN1_SPI1        (1<<10)
#define     EN1_I2C         (1<<13)
#define     EN1_UART0       (1<<17)
#define     EN1_UART1       (1<<18)
#define     EN1_UART2       (1<<19)
#define     EN1_QEI         (1<<21)
#define     EN1_USB         (1<<23)
#define     EN1_PVT         (1<<28)
#define     EN1_BODY_BIAS   (1<<29)
#define     EN1_EZH         (1<<31)

/* PDRUNCFG bit info. */
#define     PDEN_MAIN_CLK   (1<<0)
#define     PDEN_MAIN_REG   (1<<1)
#define     PDEN_MAIN_REG_LP (1<<2)
#define     PDEN_IRC_OSC    (1<<3)
#define     PDEN_DIE_IRC    (1<<4)
#define     PDEN_IRC        (PDEN_IRC_OSC | PDEN_DIE_IRC)
#define     PDEN_FLASH      (1<<5)
#define     PDEN_EE         (1<<6)
#define     PDEN_BOD        (1<<8)
#define     PDEN_USB_PHY    (1<<9)
#define     PDEN_ADC0       (1<<10)
#define     PDEN_ADC1       (1<<11)
#define     PDEN_DAC0       (1<<12)
#define     PDEN_COMP0      (1<<13)
#define     PDEN_COMP1      (1<<14)
#define     PDEN_COMP2      (1<<15)
#define     PDEN_COMP3      (1<<16)
#define     PDEN_IREF       (1<<17)
#define     PDEN_TEMP_SENSE (1<<18)
#define     PDEN_VDDA_DIV   (1<<19)
#define     PDEN_WDT_OSC    (1<<20)
#define     PDEN_SYS_OSC    (1<<21)
#define     PDEN_SYS_PLL    (1<<22)
#define     PDEN_USB_PLL    (1<<23)
#define     PDEN_SCT_PLL    (1<<24)

#ifdef __cplusplus
}
#endif 


#endif  // __LPC13AXX_H__
